TEXT = {
    'start': "<b>Nano Banana AI Photoshop — ақылды фоторедактор</b> 🍌✨\n"
             "📸 Фотосуретті жүктеңіз ➜ қысқаша сипаттама қосыңыз ➜ мінсіз нәтижені алыңыз!\n\n"
             "<i>Бот Nano Banana нейрожүйесін пайдаланып, суреттерді дәл өңдейді: сапаны жақсарту, стильді эффектілер, ретушь, объектілерді ауыстыру және тағы басқалар</i>\n\n"
             "Қалай жұмыс істейді:\n"
             "1. Сипаттамасымен бірге фото жібересіз. Сипаттамада не өзгерту керек екенін көрсетіңіз\n"
             "2. Бот суретті Nano Banana арқылы өңдейді\n"
             "3. Жаңартылған кәсіби нұсқасын аласыз\n\n"
             "Тез, ыңғайлы және артық әрекетсіз — Telegram-дағы жеке Photoshop-ыңыз\n\n"
             "<i>Алғашқы 3 генерация <b>ТЕГІН!</b></i>",

    "photo_accepted": "🪄 Фотосуретті өңдеп жатырмын, көп уақыт алмайды...",
    
    "generation_error": "⚠️ Суретті өңдеу кезінде қате пайда болды.\n"
                        "Сізге 1 тегін генерация қостық\n"
                        "Қайтадан фото жіберіп көріңіз",
    
    "error_not_image": "⚠️ JPG немесе PNG форматындағы суретті сипаттамамен бірге жіберіңіз",
    "error_no_caption": "⚠️ Фотоға міндетті түрде сипаттама қосыңыз",
    
    "payment": {
        "label": "Фотоны өңдеу",
        "title": "Фотоны өңдеу",
        "description": "✨ Nano Banana көмегімен фотосуретті өңдеу\n"
                       "Төлемнен кейін жаңартылған фотосуретті жіберемін",
        "payment_accepted": "Төлем қабылданды ✅\n🪄 Фотосуретті өңдеп жатырмын..."
    },

    "photo_is_ready": "✨ Дайын!"
}

BUTTONS_TEXT = {
    'pay': "Төлеу ⭐ {amount}"
}

IMAGES = {'start': "AgACAgIAAxkBAAMaaRr7iJb9DvDN_vG6PRnf18Ndny0AAmwOaxs2utlIVNOZJZsmJQQBAAMCAAN3AAM2BA"}
