TEXT = {'start': "<b>Nano Banana AI Photoshop — умный фоторедактор</b> 🍌✨\n"
        "📸 Загрузи фотографию ➜ добавь короткое описание ➜ получи идеальный результат!\n\n"
        "<i>Бот использует нейросеть Nano Banana для точной обработки изображений: улучшение качества, стильные эффекты, ретушь, замена объектов и многое другое</i>\n\n"
        "Как работает:\n"
        "1. Отправляешь фото c описанием. В описании пишешь, что нужно изменить или улучшить\n"
        "2. Бот обрабатывает изображение с помощью Nano Banana\n"
        "3. Получаешь обновлённую профессиональную версию фото\n\n"
        "Быстро, удобно и без лишних действий — твой персональный Photoshop в Telegram\n\n"
        "<i>Первые 3 генерации <b>БЕСПЛАТНО!</b></i>",
        "photo_accepted": "🪄 Обрабатываю фото, это не займет много времени...",
        "generation_error": "⚠️ Ошибка при обработке изображения.\n"
                                "Мы добавили вам 1 бесплатную генерацию\n"
                                "Попробуйте снова отправить фотографию",
        "error_not_image": "⚠️ Пожалуйста, отправьте изображение в формате JPG, PNG с описанием",
        "error_no_caption": "⚠️ Фото должно быть с подписью",
        "payment": {"label": "Обработать фото",
                    "title": "Обработать фото",
                    "description": "✨ Обработать фотографию с помощью Nano Banana\n"
                                        "После оплаты я верну обновлённую фотографию",
                    "payment_accepted": "Платеж принят ✅\n🪄 Обрабатываю фото, это не займет много времени..."},
        "photo_is_ready": "✨ Готово!"
        }

BUTTONS_TEXT = {'pay': "Оплатить ⭐ {amount}"}

IMAGES = {'start': "AgACAgIAAxkBAAMWaRr5LrXcEFeEonSOF0xfU1rIUXoAAlMOaxs2utlIkiHElqVmLaYBAAMCAAN3AAM2BA"}

